# GetOutOfDatePartStatus Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConfigurationReloadInfo..::..GetOutOfDatePartStatus Method
ConfigurationReloadInfo Class See Also
---
Access reload information for out of date part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2019
# Syntax
C#
---
```text
public ReloadSwapOutInfo GetOutOfDatePartStatus(
	int index
)
```

Visual Basic
---
```text
Public Function GetOutOfDatePartStatus ( _
	index As Integer _
) As ReloadSwapOutInfo
```

Visual C++
---
```text
public:
ReloadSwapOutInfo^ GetOutOfDatePartStatus(
	int index
)
```

# ### Parameters
index
    Type: System..::..Int32 The index of the information about the part being reloaded. Must be between 0 and OutOfDatePartCount.
# ### Return Value
Information about the part being reloaded.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The index is out of range. |
| Autodesk.Revit.Exceptions..::..DisabledDisciplineException | None of the following disciplines is enabled: Mechanical Electrical Piping. |

# See Also
ConfigurationReloadInfo Class
Autodesk.Revit.DB Namespace